Tekla Open API Reference for Tekla Structures 2025
NumberingSeriesNullable.StartNumber Property
 Gets or sets the numbering start number.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int? StartNumber { get; set; }
Public Property StartNumber As Integer?
	Get
	Set
Property Value
Type: Nullable<Int32>
See Also
Reference
NumberingSeriesNullable Class
Tekla.Structures.Model Namespace